## Q1. List any five functions of the pandas library with execution.

In [60]:

import pandas as pd
df=pd.read_csv("Titanic-Dataset.csv")

In [61]:
####                             1st Function 
df.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [62]:
#                          2 Function describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [63]:
#3.                             Function sum
df["Fare"].sum()

28693.9493

In [64]:
#                           4th group by function
df.groupby("Survived")["Fare"].sum()

Survived
0    12142.7199
1    16551.2294
Name: Fare, dtype: float64

In [65]:
                                # 5th dropna
df.dropna(axis=1)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [68]:
df2=pd.DataFrame({"A":[1,2,3],"B":[4,5,6],"C":[7,8,9]},index=[1,3,5])

In [69]:
df2

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [70]:
df2.rename(columns={"A": "values", "B": "B"})
df3=pd.DataFrame({"Values":[1,2,3,4,5,6,7,8],"B":[4,5,619,44,34,23,12,144],"C":[17,28,39,45,67,87,56,344]})

In [71]:
df3

   Values    B    C
0       1    4   17
1       2    5   28
2       3  619   39
3       4   44   45
4       5   34   67
5       6   23   87
6       7   12   56
7       8  144  344

In [72]:
df3.values[0:3].sum()

718

In [73]:
def sum_first_three_values(df):
    """Function that iterates over a DataFrame and calculates the sum of the first three values in the 'Values' column"""
    # get the first three Values
    total=0
    values = df['Values'][:3]
    # calculate the sum
    for i in values:
        total=total+i
    # print the result
    return total

In [74]:
sum_first_three_values(df3)

6

In [75]:
(df3.Values[0]).dtype

dtype('int64')

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [76]:
dff=pd.DataFrame(df["Name"])

In [77]:
dff["Word_count"]=dff["Name"].apply(lambda x :len(x.split()))
dff

                                                  Name  Word_count
0                              Braund, Mr. Owen Harris           4
1    Cumings, Mrs. John Bradley (Florence Briggs Th...           7
2                               Heikkinen, Miss. Laina           3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)           7
4                             Allen, Mr. William Henry           4
..                                                 ...         ...
886                              Montvila, Rev. Juozas           3
887                       Graham, Miss. Margaret Edith           4
888           Johnston, Miss. Catherine Helen "Carrie"           5
889                              Behr, Mr. Karl Howell           4
890                                Dooley, Mr. Patrick           3

[891 rows x 2 columns]

# Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in the DataFrame, while DataFrame.shape() returns the number of rows and columns in the DataFrame as a tuple.

....

# Q6. Which function of pandas do we use to read an excel file?

The function to read an excel file in pandas is read_excel().

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [78]:
a="divyanshu@gmail.com i m"

In [79]:
a.split("@")[0]

'divyanshu'

In [80]:
data=pd.DataFrame({"2":["Divyanshu@gmail.com","shivansh@gmail.com"]},index=[1,2])

In [81]:
data.head()

                     2
1  Divyanshu@gmail.com
2   shivansh@gmail.com

In [82]:
def extract_username(email):
    return email.split('@')[0]

In [83]:
data['Username'] = data["2"].apply(extract_username)

In [84]:
data.head()

                     2   Username
1  Divyanshu@gmail.com  Divyanshu
2   shivansh@gmail.com   shivansh

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [85]:
df4=[(df3["C"] <=5) & (df3["B"] <=10)]

In [86]:
data=df3[(df3['B'] > 5) & (df3['C'] > 10)]

In [87]:
data.head()

   Values    B   C
2       3  619  39
3       4   44  45
4       5   34  67
5       6   23  87
6       7   12  56

In [88]:
df3.head()

   Values    B   C
0       1    4  17
1       2    5  28
2       3  619  39
3       4   44  45
4       5   34  67

##Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [89]:
df3["Values"].mean()

4.5

In [90]:
df3["Values"].median()

4.5

In [91]:
df3["Values"].std()

2.449489742783178

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

Rolling function is applied to series of data . Specify The windows =n argument and apply the approprite statistical function on top

In [92]:
import pandas as pd
import numpy as np 
import random

In [93]:
a=pd.DataFrame(np.random.randn(10,4),index=pd.date_range('1/1/2000',periods=10),columns=['One',"Two","Sales","Four"])

In [94]:
print(a.rolling(window=7).mean())

                 One       Two     Sales      Four
2000-01-01       NaN       NaN       NaN       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03       NaN       NaN       NaN       NaN
2000-01-04       NaN       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07  0.134752 -0.333196 -0.784117 -0.075051
2000-01-08 -0.006825  0.030090 -0.352895 -0.206071
2000-01-09  0.066927 -0.116091 -0.487218 -0.302193
2000-01-10 -0.330209  0.070753 -0.420237 -0.106782

In [95]:
# Windows =3 mean

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [96]:
s = pd.DataFrame(pd.date_range('2016-12-31', '2017-01-08', freq='D'),columns=["Date"])

In [97]:
s["Days_Name"]=s["Date"].dt.day_name()

In [98]:
s

        Date  Days_Name
0 2016-12-31   Saturday
1 2017-01-01     Sunday
2 2017-01-02     Monday
3 2017-01-03    Tuesday
4 2017-01-04  Wednesday
5 2017-01-05   Thursday
6 2017-01-06     Friday
7 2017-01-07   Saturday
8 2017-01-08     Sunday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [99]:
d= pd.DataFrame(pd.date_range('2022-09-01', '2023-07-31', freq='D'),columns=["Date"])

In [100]:
d

          Date
0   2022-09-01
1   2022-09-02
2   2022-09-03
3   2022-09-04
4   2022-09-05
..         ...
329 2023-07-27
330 2023-07-28
331 2023-07-29
332 2023-07-30
333 2023-07-31

[334 rows x 1 columns]

In [101]:
New_Date = d[(d['Date'] >"2023-01-01") & (d['Date'] <="2023-01-31" )]

In [102]:
New_Date

          Date
123 2023-01-02
124 2023-01-03
125 2023-01-04
126 2023-01-05
127 2023-01-06
128 2023-01-07
129 2023-01-08
130 2023-01-09
131 2023-01-10
132 2023-01-11
133 2023-01-12
134 2023-01-13
135 2023-01-14
136 2023-01-15
137 2023-01-16
138 2023-01-17
139 2023-01-18
140 2023-01-19
141 2023-01-20
142 2023-01-21
143 2023-01-22
144 2023-01-23
145 2023-01-24
146 2023-01-25
147 2023-01-26
148 2023-01-27
149 2023-01-28
150 2023-01-29
151 2023-01-30
152 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [103]:
import pandas